
#Область ОписаниеПеременных

Перем ИмяПользователя;

#КонецОбласти


#Область ОбработчикиСобытий

//Ctrl+Alt+P - показать список "Процедуры и функции"

Процедура ПриНачалеРаботыСистемы()
	
	//СказатьПривет();
	
КонецПроцедуры


АСИНХ Процедура СказатьПривет()
	
	ИмяПользователя = ЖДАТЬ ВвестиСтрокуАсинх(ИмяПользователя, "Как вас зовут");	
	ПредупреждениеАсинх("Привет, пользователь" + ИмяПользователя + "!",, "Приветствие");  
	
КонецПроцедуры


#КонецОбласти


#Область Инициализация

ИмяПользователя = "Имя";
	
#КонецОбласти


#Область БазисПрограммирования
	
//===============================Переменные===============================

//А = 10;
//Б = 5;
//// А и Б - переменные числового типа

//ПервыйРезультат = А + Б + 100;

////Неправильные названия переменных:
////	1Результат = А + Б + 100;
////	Первый результат = А + Б + 100;
////	Первый-результат = А + Б + 100;      

//Сообщить(ПервыйРезультат);

////Изменение значения переменной
//Б = 15;

////Выражение
//ВторойРезультат = а - б + 10; 

////А,Б,10 	- операнды
////-,+,= 	- операторы (операции)

//Сообщить(вТОройРЕзуЛЬТАТ);


////Сообщить("Привет, мир!");
////Сообщить("Как дела?")    
////Это мой первый комментарий    


//===============================Операции с типами значений===============================

 ////1.Операция конкатенации (склеивание строк)
 //ТекстПриветствия = "Добрый день, Василий! Приветствую Вас, Фёдор!";
 
 //ИмяСотрудника_1 = "Василий";
 //ИмяСотрудника_2 = "Фёдор";
 
//ТекстПриветствия = "Добрый день, " + ИмяСотрудника_1 + "! Приветствую Вас, " + ИмяСотрудника_2 + "!";


////1.1 СтрШаблон - формирование строки по шаблону
//ШаблонПриветствия = "Добрый день, %2! Приветствую Вас, %1!";
//ТекстПриветствия = СтрШаблон (ШаблонПриветствия, ИмяСотрудника_1, ИмяСотрудника 2);

//Сообщить (ТекстПриветствия) ;


//2.Неявные преобразования типов, сложение двух разнотипных значений
//НазваниеПродукта = "1С:Предприятие ";
//ВерсияПродукта = 8.3;

//ТекстВывода = "1С:Предприятие " + 8.3;
//ТекстВывода = НазваниеПродукта + ВерсияПродукта;
//ТекстВывода = НазваниеПродукта + Строка (ВерсияПродукта) ;

//ТекстВывода = Строка(1) + "С:Предприятие 8.3";
//ТекстВывода = "" + 1 + "С:Предприятие 8.3";

//Сообщить (ТекстВывода) ;


////З.Работа с типом дата
//ДатаУрока = '20220131120000';
//ДатаУрока = '2022.01.31 12:00:00';
//ДатаУрока = '2022-01-31 12:00:00';

////Список символов разделителей: 		"-", "_", "/", "\", ":", "."

//ДатаУрока = ТекущаяДата (); 

//Сообщить (ДатаУрока) ;

//3.1 Операции сложения и вычитания
//ДатаНачалаУрока 		= '2022.01.31 09:30:00';
//ДатаОкончанияУрока 	= '2022.01.31 13:00:00';

//ДатаНачалаУрока = ДатаНачалаУрока + 1800;

//Сообщить ("Дата начала урока: " 		+ ДатаНачалаУрока) ;
//Сообщить ("Дата окончания урока: " 	+ ДатаОкончанияУрока) ;

//ДлительностьУрока_ВСекундах 	= ДатаОкончанияУрока - ДатаНачалаУрока;
//ДлительностьУрока_Датой 		= '0001-01-01' + ДлительностьУрока_ВСекундах;

//ДлительностьУрока = СтрШаблон ("Длительность урока: %1ч. %2м.", Час (ДлительностьУрока_Датой), Минута (ДлительностьУрока_Датой) );

//Сообщить (ДлительностьУрока) ; 


//4. Булевы операции
//УрокНачался	= Истина;
//УрокИдёт 	= Истина;
//УрокОкончен = Ложь;

////Таблица истиности − логическое умножение
////|---|---|---|
////|   | 0 | 1 |       
////|---|---|---|
////| 0 | 0 | 0 |
////|---|---|---|
////| 1 | 0 | 1 |
////|---|---|---|

////Таблица истиности − логическое Сложение
////|---|---|---|
////|   | 0 | 1 |       
////|---|---|---|
////| 0 | 0 | 1 |
////|---|---|---|
////| 1 | 1 | 1 |
////|---|---|---|

//РезультатВыражения = УрокНачался + УрокИдёт + УрокОкончен;

////Булевы операторы:
////И 	- Логическое умножение
////ИЛИ 	- Логическое сложение
////НЕ 	- Логическое отрицание

//РезультатВыражения = УрокНачался ИЛИ УрокИдёт ИЛИ УрокОкончен;
//РезультатВыражения = УрокНачался И УрокИдёт И УрокОкончен;
//РезультатВыражения = УрокНачался И УрокИдёт И НЕ УрокОкончен;

//Сообщить(РезультатВыражения);


//===============================Процедуры и функции===============================

//1. Процедуры вывода
//Сообщить("Привет 1С!");

////Работают только в обработчиках событий
//ПредупреждениеАсинх("Привет 1С!");
//ПоказатьОповещениеПользователя("Привет 1С!");

//Главное меню - Справка - Содержание справки - Встроенный язык - Глобальный контекст


//2.Функции работы со строкой

//Главное меню - Справка - Содержание справки - Функции работы со значениями типа Строка

//МояСтрока = "Это моя строка проверки функции.";

//Результат = СтрДлина(МояСтрока);
//Результат = СтрНайти(МояСтрока, "о", НаправлениеПоиска.СКонца);
//Результат = Лев(МояСтрока, 14) + "!";
//Результат = Сред(МояСтрока, 5, 10);
//Результат = СокрЛП(МояСтрока);
//Результат = СтрНачинаетсяС(МояСтрока, "Это");
//Результат = НРег (МояСтрока);
//Результат = ТРег (МояСтрока);

//Сообщить(Результат);


//3.Функции работы с числами

//Главное меню - Справка - Содержание справки - Функции работы со значениями типа Число     

//МоёЧисло = 5.758;

//Результат = Окр(МоёЧисло, -3);
//Результат = Цел(МоёЧисло);

//Сообщить(Результат);


//4.Функции работы со значениями типа Дата

//Главное меню - Справка - Содержание справки - Функции работы со значениями типа Дата 

//МояДата = '2022-01-31 10:00:00';

//Результат = Год(МояДата);
//Результат = НачалоНедели(МояДата);
//Результат = КонецГода(МояДата);
//Результат = НеделяГода(МояДата);
//Результат = ДобавитьМесяц(МояДата, 12);
//Результат = МояДата + 86400;

//Сообщить(Результат);


//5.Функции работы со значениями типа Тип

//Главное меню - Справка - Содержание справки - Функции работы со значениями типа Тип

//МояПеременная = 100;

//Результат = Тип("Строка");
//Результат = ТипЗнч(МояПеременная);

//Сообщить(Результат);


//6.Операции сравнения

//">" 	- больше
//"<" 	- меньше
//">=" 	- больше или равно
//"<=" 	- меньше или равно
//"=" 	- равно
//"<>" 	- не равно

//А = 15;
//Б = 10;

//РезультатСравнения = (А = Б);

//МоёЗначение = "123";

//РезультатСравнения = ( ТипЗнч(МоёЗначение) = ТИП("Строка"));

//Сообщить(РезультатСравнения);


//7.Синтаксические конструкции

//ИмяСотрудника = "Фёдор";

////7.1 Блок условия 

////Сtrl+Q - Вызов шаблона

////Если <Выражение> Тогда
////
////	<Алгоритм>
////
////КонецЕсли;

//Если ИмяСотрудника = "Василий" Тогда
//	
//	Сообщить("Доброе утро, Василий!"); 
//	
//ИначеЕсли ИмяСотрудника = "Фёдор" Тогда
//	
//	Сообщить("Привтетствую Вас, Фёдор!");
//	
//Иначе       
//	
//	Сообщить("Доброе утро!");
//	
//КонецЕсли;


//7.2 Блок цикла со счётчиком 
//Сообщить("Вызывается талон с номером " + 1);
//Сообщить("Вызывается талон с номером " + 2);
//Сообщить("Вызывается талон с номером " + 3);

//Для <Счетчик> = <НачальноеЗначение> По <КонечноеЗначение> Цикл
//	<Алгоритм>
//КонецЦикла;

//Shift+Alt+F

//Для НомерТалона = 1 По 3 Цикл
//	Сообщить("Вызывается талон с номером " + НомерТалона);
//КонецЦикла;


//7.3 Блок цикла с условием
//ОсталосьКонфет = 10;

//Пока ОсталосьКонфет > 0 Цикл
//	
//	ОсталосьКонфет = ОсталосьКонфет - 1;
//	Сообщить("Съели конфету. Всего осталось: " + ОсталосьКонфет);
//	
//КонецЦикла;

//Сообщить("Все конфеты съели");

#КонецОбласти
































