
#Область ОбработчикиСобытий 

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	//Отклюение стандартного алгоритма - массив "Поля" состоит из одного элемента "Наименование"
	СтандартнаяОбработка = Ложь;
	
	//Заоплнение массива "Поля" требуемыми для решения задачи реквизитами
	Поля.Добавить("Наименование");
	Поля.Добавить("ДатаРождения") 
	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	//Отключение стандартного алгоритма:
	//Представление = Данные.Наименование
	СтандартнаяОбработка = Ложь;  
	
	Если Данные.ДатаРождения > '0001-01-01' Тогда
		
		ВозрастВСекундах 	= ТекущаяДата() - Данные.ДатаРождения;
		ВозрастСотрудника 	= Год('0001-01-01' + ВозрастВСекундах - 86400) - 1; 
		
		Представление = СтрШаблон("%1 (%2 лет)", Данные.Наименование, ВозрастСотрудника);	
		
	Иначе
		
		Представление = Данные.Наименование	
		
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти